Catalogs/ПользователиСПравомАкцептаОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПользователиСПравомАкцептаОплат</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРассылкиЗаявкиНаУслугиИМатериалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРассылокЗаявкиНаУслугиИМатериалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПоАвансам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПоЗаявкам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПользователиСПравомАкцептаОплат/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Текущий = Справочники.ПользователиСПравомАкцептаОплат.НайтиПоРеквизиту("Пользователь",параметрыСеанса.ТекущийПользователь);
	Если Текущий.Пустая()
			ИЛИ НЕ Текущий.Активен Тогда
		ЭтаФорма.ТолькоПросмотр = истина;
	КонецЕсли;
	Если Объект.Родитель<>Текущий Тогда
		Элементы.ЛимитПоАвансам.Доступность = Ложь;
		Элементы.ЛимитПоЗаявкам.Доступность = Ложь; //+++АК LAGP 2018.06.04 ИП-00018684 Продолжение традиции раз так надо.
	КонецЕсли;	
	
	//+++АК ZHAS 18-08-17 ИП-00015200.01
	СЕПолныеПрава 						= УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПланыВидовХарактеристик.ПраваПользователей.ПолныеПраваНаРедактированиеСЕ		, Ложь);
	СЕПользователиСПравомАкцептаОплат 	= УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПланыВидовХарактеристик.ПраваПользователей.ПользователиСПравомАкцептаОплат		, Ложь);
	//---АК ZHAS 18-08-17 ИП-00015200.01
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Наименование = Объект.Пользователь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ Объект.Родитель.Активен Тогда
		Сообщить("Запрещено редактировать не активную ветку акцептантов.");
		Отказ = Истина;
	КонецЕсли;	
	
	Если Объект.Родитель.Пользователь <> ПараметрыСеанса.ТекущийПользователь Тогда
		Сообщить("Запрещено редактировать чужую ветку акцептантов.");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


Процедура АктивенПриИзмененииСервер()
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если Объект.Родитель.Пользователь <> ТекущийПользователь Тогда
		Объект.Родитель = Справочники.ПользователиСПравомАкцептаОплат.НайтиПоРеквизиту("Пользователь", ТекущийПользователь);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура АктивенПриИзменении(Элемент)
	
	АктивенПриИзмененииСервер();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЛимитПоАвансамПриИзменении(Элемент)
	Если Объект.ЛимитПоАвансам > Объект.Родитель.ЛимитПоАвансам Тогда
		Предупреждение("Лимит по авансам не может превышать лимит по авансам ""родителя""");
	КонецЕсли;	
	Объект.ЛимитПоАвансам = Объект.Родитель.ЛимитПоАвансам;
КонецПроцедуры

//+++АК ZHAS 18-08-17 ИП-00015200.01
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//+++АК ZHAS 18-08-17 ИП-00015200.01
	ОтрегулироватьФормуПоПравам();
	
КонецПроцедуры
//---АК ZHAS 18-08-17 ИП-00015200.01

//+++АК ZHAS 18-08-17 ИП-00015200.01
Процедура ОтрегулироватьФормуПоПравам()
	
	//+++АК ZHAS 18-08-17 ИП-00015200.01
	Если СЕПолныеПрава Тогда
		Возврат;
	КонецЕсли;	
	
	//+++АК ZHAS 18-08-17 ИП-00015200.01
	Если СЕПользователиСПравомАкцептаОплат	Тогда
		Элементы.ВариантРассылкиЗаявкиНаУслугиИМатериалы.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры	
//---АК ZHAS 18-08-17 ИП-00015200.01
